MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK60FN1M0VLQ15/mcu.h
#define MPU                           0x00000004      // MPU clock gate control
#define DMA                           0x00000002      // DMA controller clock gate control
#define FLEXBUS                       0x00000001      // FlexBus controller clock gate control


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_CLKDIV1 register.
//
//*****************************************************************************

#define OUTDIV1                       0x780000000      // Clock 1 output divider value
#define OUTDIV2                       0x78000000      // Clock 2 output divider value
#define OUTDIV3                       0x07800000      // Clock 3 output divider value
#define OUTDIV4                       0x00780000      // Clock 4 output divider value


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_CLKDIV2 register.
//
//*****************************************************************************

#define USBHSDIV                      0x00003800      // USB HS clock divider divisor
#define USBHSFRAC                     0x00000100      // USB HS clock divider fraction
#define USBFSDIV                      0x00000038      // USB FS clock divider divisor
#define USBFSFRAC                     0x00000001      // USB FS clock divider fraction


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_FCFG1 register.
//
//*****************************************************************************

#define NVMSIZE                       0x780000000      // FlexNVM size
#define PFSIZE                        0x78000000      // Program flash size
#define EESIZE                        0x00780000      // EEPROM size
#define DEPART                        0x00007800      // FlexNVM partition
#define FTFDIS                        0x00000001      // Disable FTFE


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_FCFG2 register.
//
//*****************************************************************************

#define SWAPPFLSH                     0x80000000      // Swap program flash
#define PFLSH                         0x00800000      // Program flash only
#define MAXADDR23                     0x07E00000      // Max address block 2 or 3
#define MAXADDR01                     0x7E0000000      // Max address block 0 or 1


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_CLKDIV4 register.
//
//*****************************************************************************

#define NFCDIV                        0xF80000000      // NFC clock divider divisor
#define NFCFRAC                       0x1C000000      // NFC clock divider fraction
#define TRACEDIV                      0x00000038      // Trace clock divider divisor
#define TRACEFRAC                     0x00000001      // Trace clock divider fraction


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_MCR register.
//
//*****************************************************************************

#define TRACECLKDI                    0x80000000      // Trace clock divider
#define PDBLOOP                       0x00100000      // PDB loop mode
#define PDBLOOP                       0x10000000      // PDB loop control ::


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_UIDH register.
//
//*****************************************************************************

#define UID                           0x7FFFFFFF80000000      // Unique Identification


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_UIDMH register.
//
//*****************************************************************************

#define UID                           0x7FFFFFFF80000000      // Unique Identification


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_UIDML register.
//
//*****************************************************************************

#define UID                           0x7FFFFFFF80000000      // Unique Identification


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_UIDL register.
//
//*****************************************************************************

#define UID                           0x7FFFFFFF80000000      // Unique Identification


//*****************************************************************************
//
// The following are defines for the bit fields in the RCM_SRS0 register.
//
//*****************************************************************************

#define POR                           0x00000080      // Power-On Reset
#define PIN                           0x00000040      // External Reset Pin
#define WDOG                          0x00000020      // Watchdog
#define LOC                           0x00000004      // Loss-of-Clock Reset
#define LVD                           0x00000002      // Low-Voltage Detect Reset
#define WAKEUP                        0x00000001      // Low Leakage Wakeup Reset


//*****************************************************************************
//
// The following are defines for the bit fields in the RCM_SRS1 register.
//
//*****************************************************************************

#define SACKERR                       0x00000020      // Stop Mode Acknowledge Error Reset
#define EZPT                          0x00000010      // EzPort Reset
#define MDM_AP                        0x00000008      // MDM-AP System Reset Request
#define SW                            0x00000004      // Software
#define LOCKUP                        0x00000002      // Core Lockup
#define JTAG                          0x00000001      // JTAG Generated Reset


//*****************************************************************************
//
// The following are defines for the bit fields in the RCM_RPFC register.
//
//*****************************************************************************

#define RSTFLTSS                      0x00000004      // Reset Pin Filter Select in Stop Mode
#define RSTFLTSRW                     0x00000006      // Reset Pin Filter Select in Run and Wait Modes


//*****************************************************************************
//
// The following are defines for the bit fields in the RCM_RPFW register.
//
//*****************************************************************************

#define RSTFLTSEL                     0x000001F0      // Reset Pin Filter Bus Clock Select


//*****************************************************************************
//
// The following are defines for the bit fields in the RCM_MR register.
//
//*****************************************************************************

