MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK60FN1M0VLQ15/mcu.h
#define data[95:64]                   0x7FFFFFFF80000000      // Bits [95:64] of data entry


//*****************************************************************************
//
// The following are defines for the bit fields in the FMC_DATAW3SnML register.
//
//*****************************************************************************

#define data[63:32]                   0x7FFFFFFF80000000      // Bits [63:32] of data entry


//*****************************************************************************
//
// The following are defines for the bit fields in the FMC_DATAW3SnLM register.
//
//*****************************************************************************

#define data[31:0]                    0x7FFFFFFF80000000      // Bits [31:0] of data entry ::


//*****************************************************************************
//
// The following are defines for the bit fields in the NFC_CMD1 register.
//
//*****************************************************************************

#define BYTE2                         0x7F80000000      // Second command byte that may be sent to the flash device
#define BYTE3                         0x7F800000      // Third command byte that may be sent to the flash device


//*****************************************************************************
//
// The following are defines for the bit fields in the NFC_CMD2 register.
//
//*****************************************************************************

#define BYTE1                         0x7F80000000      // First command byte that may be sent to the flash device
#define CODE                          0x7FFF800000      // User-defined flash operation sequencer
#define Reserved                      0x00000F80      // This field is reserved
#define BUFNO                         0x0000000C      // Internal buffer number used for this command
#define BUSY_START                    0x00000001      // Busy indicator and start command


//*****************************************************************************
//
// The following are defines for the bit fields in the NFC_CAR register.
//
//*****************************************************************************

#define BYTE2                         0x007F8000      // Second byte of column address
#define BYTE1                         0x00007F80      // First byte of column address


//*****************************************************************************
//
// The following are defines for the bit fields in the NFC_RAR register.
//
//*****************************************************************************

#define RB1                           0x20000000      // Ready/busy 1 enable
#define RB0                           0x10000000      // Ready/busy 0 enable
#define CS1                           0x02000000      // Chip select 1 enable
#define CS0                           0x01000000      // Chip select 0 enable
#define BYTE3                         0x7F800000      // Third byte of row address
#define BYTE2                         0x007F8000      // Second byte of row address
#define BYTE1                         0x00007F80      // First byte of row address


//*****************************************************************************
//
// The following are defines for the bit fields in the NFC_RPT register.
//
//*****************************************************************************

#define COUNT                         0x7FFF8000      // 16-bit repeat count


//*****************************************************************************
//
// The following are defines for the bit fields in the NFC_RAI register.
//
//*****************************************************************************

#define INC3                          0x7F800000      // Increment for the third byte of row address
#define INC2                          0x007F8000      // Increment for the second byte of row address
#define INC1                          0x00007F80      // Increment for the first byte of row address


//*****************************************************************************
//
// The following are defines for the bit fields in the NFC_SR1 register.
//
//*****************************************************************************

#define ID1                           0x7F80000000      // First byte returned by read ID command
#define ID2                           0x7F800000      // Second byte returned by read ID command
#define ID3                           0x007F8000      // Third byte returned by read ID command
#define ID4                           0x00007F80      // Fourth byte returned by read ID command


//*****************************************************************************
//
// The following are defines for the bit fields in the NFC_SR2 register.
//
//*****************************************************************************

#define ID5                           0x7F80000000      // Fifth byte returned by read ID command
#define STATUS1                       0x00007F80      // Byte returned by read status command


//*****************************************************************************
//
// The following are defines for the bit fields in the NFC_DMA_CH1 register.
//
//*****************************************************************************

#define ADDRESS                       0x7FFFFFFF80000000      // DMA channel 1 address. It is 8-byte aligned.


//*****************************************************************************
//
// The following are defines for the bit fields in the NFC_DMACFG register.
//
//*****************************************************************************

#define COUNT1                        0x7FF80000000      // Number of bytes to be transferred by DMA channel 1. It should be multiple of 8 bytes.
#define COUNT2                        0x03F80000      // Number of bytes to be transferred by DMA channel 2. It should be multiple of 8 bytes.
#define OFFSET2                       0x0000F000      // 256-byte offset for DMA channel 2. DMA channel 2 transfer starts at this offset count x 256 bytes. For example, if OFFSET2 = 0x2, DMA channel 2 transfer starts at 0x200.
#define ACT1                          0x00000002      // DMA channel 1 status
#define ACT2                          0x00000001      // DMA channel 2 status


//*****************************************************************************
//
// The following are defines for the bit fields in the NFC_SWAP register.
//
//*****************************************************************************

#define ADDR1                         0x3FF8000000      // Lower swap address
#define Reserved                      0x001F0000      // This field is reserved
#define ADDR2                         0x003FF800      // Upper swap address
#define Reserved                      0x00000001      // This field is reserved


//*****************************************************************************
//
// The following are defines for the bit fields in the NFC_SECSZ register.
//
//*****************************************************************************

#define SIZE                          0x01FFF000      // Size in bytes of one elementary transfer unit


//*****************************************************************************
//
// The following are defines for the bit fields in the NFC_CFG register.
//
//*****************************************************************************

#define STOPWERR                      0x80000000      // Stopping on write error
#define ECCAD[11:3]                   0x7FC0000000      // Byte address in SRAM where ECC status is written.
#define ECCSRAM                       0x00200000      // Writing ECC status to SRAM
#define DMAREQ                        0x00100000      // Transferring sectors after ECC
#define ECCMODE                       0x00380000      // ECC type
#define FAST                          0x00010000      // See the "Fast Flash Configuration for EDO" section for more details.
#define IDCNT                         0x00038000      // Number of bytes that are read for the read id command.
#define TIMEOUT                       0x0001F000      // The number of flash_clk cycles from NFC_WE high to either:
#define BITWIDTH                      0x00000080      // Flash mode width
#define Reserved                      0x00000040      // This read-only field is reserved and always has the value 0
#define AIAD                          0x00000020      // Auto-incrementing of flash row address
#define AIBN                          0x00000010      // Auto-incrementing of buffer numbers
#define PAGECNT                       0x00000078      // Number of virtual pages (in one physical flash page) to be programmed or read, etc.


//*****************************************************************************
//
// The following are defines for the bit fields in the NFC_DMA_CH2 register.
//
//*****************************************************************************

#define ADDRESS                       0x7FFFFFFF80000000      // DMA channel 2 address, it is 8-byte aligned.


//*****************************************************************************
//
// The following are defines for the bit fields in the NFC_ISR register.
//
//*****************************************************************************

#define WERR                          0x80000000      // Write error interrupt
#define DONE                          0x40000000      // DONE interrupt
#define IDLE                          0x20000000      // Command idle interrupt
#define WERRNS                        0x08000000      // Write error status
#define CMDBUSY                       0x04000000      // Command busy status
#define RESBUSY                       0x02000000      // Result busy status
#define ECCBUSY                       0x01000000      // ECC busy status
#define DMABUSY                       0x00800000      // DMA busy status
#define WERRCLR                       0x00400000      // Write error clear
#define DONECLR                       0x00200000      // Done clear
#define IDLECLR                       0x00100000      // Idle clear
#define WERREN                        0x00080000      // Write error enable
#define DONEEN                        0x00040000      // Done enable
#define IDLEEN                        0x00020000      // Idle enable
#define RESBN                         0x00010000      // Result busy enable
#define ECCBN                         0x00008000      // ECC busy enable
#define DMABN                         0x00004000      // DMA busy enable


//*****************************************************************************
//
// The following are defines for the bit fields in the FB_CSARn register.
//
//*****************************************************************************

#define BA                            0x7FFF80000000      // Base Address
#define Reserved                      0x7FFF8000      // This field is reserved


//*****************************************************************************
//
// The following are defines for the bit fields in the FB_CSMRn register.
//
//*****************************************************************************

#define BAM                           0x7FFF80000000      // Base Address Mask
#define Reserved                      0x003F8000      // This field is reserved
#define WP                            0x00000100      // Write Protect
#define Reserved                      0x00003F80      // This field is reserved
#define V                             0x00000001      // Valid


//*****************************************************************************
//
// The following are defines for the bit fields in the FB_CSCRn register.
//
//*****************************************************************************

#define SWS                           0x1F80000000      // Secondary Wait States
#define Reserved                      0x06000000      // This field is reserved
#define SWSEN                         0x00800000      // Secondary Wait State Enable
#define EXTS                          0x00400000      // Extended Transfer Start/Extended Address Latch Enable
#define ASET                          0x00600000      // Address Setup
#define RDAH                          0x00180000      // Read Address Hold or Deselect
#define WRAH                          0x00060000      // Write Address Hold or Deselect
#define WS                            0x001F8000      // Wait States
#define BLS                           0x00000200      // Byte-Lane Shift
#define AA                            0x00000100      // Auto-Acknowledge Enable
#define PS                            0x00000180      // Port Size
#define BEM                           0x00000020      // Byte-Enable Mode
#define BSTR                          0x00000010      // Burst-Read Enable
#define BSTW                          0x00000008      // Burst-Write Enable
#define Reserved                      0x0000001C      // This field is reserved


//*****************************************************************************
//
// The following are defines for the bit fields in the FB_CSPMCR register.
//
//*****************************************************************************

#define GROUP1                        0x780000000      // FlexBus Signal Group 1 Multiplex control
#define GROUP2                        0x78000000      // FlexBus Signal Group 2 Multiplex control
#define GROUP3                        0x07800000      // FlexBus Signal Group 3 Multiplex control


//*****************************************************************************
//
// The following are defines for the bit fields in the CRC_DATA register.
//
//*****************************************************************************

